# ViewScheduleExportOptions Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewScheduleExportOptions Constructor
ViewScheduleExportOptions Class See Also
---
Constructs a new instance of the ViewScheduleExportOptions class
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public ViewScheduleExportOptions()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
ViewScheduleExportOptions()
```

# See Also
ViewScheduleExportOptions Class
ViewScheduleExportOptions Overload
Autodesk.Revit.DB Namespace